program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3510.2.1"}, {"coremlc-version", "3500.32.1"}, {"coremltools-component-torch", "2.10.0"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "9.0"}})]
{
    func main<ios17>(tensor<int32, [1, ?]> attention_mask, tensor<int32, [1, ?]> input_ids) [FlexibleShapeInformation = tuple<tuple<tensor<string, []>, dict<tensor<string, []>, tensor<int32, [?]>>>, tuple<tensor<string, []>, dict<tensor<string, []>, list<tensor<int32, [2]>, ?>>>>((("DefaultShapes", {{"attention_mask", [1, 128]}, {"input_ids", [1, 128]}}), ("RangeDims", {{"attention_mask", [[1, 1], [1, 512]]}, {"input_ids", [[1, 1], [1, 512]]}})))] {
            tensor<int32, [1, 512]> bert_embeddings_position_ids = const()[name = tensor<string, []>("bert_embeddings_position_ids"), val = tensor<int32, [1, 512]>([[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195, 196, 197, 198, 199, 200, 201, 202, 203, 204, 205, 206, 207, 208, 209, 210, 211, 212, 213, 214, 215, 216, 217, 218, 219, 220, 221, 222, 223, 224, 225, 226, 227, 228, 229, 230, 231, 232, 233, 234, 235, 236, 237, 238, 239, 240, 241, 242, 243, 244, 245, 246, 247, 248, 249, 250, 251, 252, 253, 254, 255, 256, 257, 258, 259, 260, 261, 262, 263, 264, 265, 266, 267, 268, 269, 270, 271, 272, 273, 274, 275, 276, 277, 278, 279, 280, 281, 282, 283, 284, 285, 286, 287, 288, 289, 290, 291, 292, 293, 294, 295, 296, 297, 298, 299, 300, 301, 302, 303, 304, 305, 306, 307, 308, 309, 310, 311, 312, 313, 314, 315, 316, 317, 318, 319, 320, 321, 322, 323, 324, 325, 326, 327, 328, 329, 330, 331, 332, 333, 334, 335, 336, 337, 338, 339, 340, 341, 342, 343, 344, 345, 346, 347, 348, 349, 350, 351, 352, 353, 354, 355, 356, 357, 358, 359, 360, 361, 362, 363, 364, 365, 366, 367, 368, 369, 370, 371, 372, 373, 374, 375, 376, 377, 378, 379, 380, 381, 382, 383, 384, 385, 386, 387, 388, 389, 390, 391, 392, 393, 394, 395, 396, 397, 398, 399, 400, 401, 402, 403, 404, 405, 406, 407, 408, 409, 410, 411, 412, 413, 414, 415, 416, 417, 418, 419, 420, 421, 422, 423, 424, 425, 426, 427, 428, 429, 430, 431, 432, 433, 434, 435, 436, 437, 438, 439, 440, 441, 442, 443, 444, 445, 446, 447, 448, 449, 450, 451, 452, 453, 454, 455, 456, 457, 458, 459, 460, 461, 462, 463, 464, 465, 466, 467, 468, 469, 470, 471, 472, 473, 474, 475, 476, 477, 478, 479, 480, 481, 482, 483, 484, 485, 486, 487, 488, 489, 490, 491, 492, 493, 494, 495, 496, 497, 498, 499, 500, 501, 502, 503, 504, 505, 506, 507, 508, 509, 510, 511]])];
            tensor<int32, [1, ?]> input_1 = sub(x = input_ids, y = input_ids)[name = tensor<string, []>("sub_0")];
            tensor<int32, [2]> var_32_shape = shape(x = input_ids)[name = tensor<string, []>("op_32_shape")];
            tensor<int32, []> gather_0_axis_0 = const()[name = tensor<string, []>("gather_0_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_0_batch_dims_0 = const()[name = tensor<string, []>("gather_0_batch_dims_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> gather_0_validate_indices_0 = const()[name = tensor<string, []>("gather_0_validate_indices_0"), val = tensor<bool, []>(false)];
            tensor<string, []> var_32_shape_to_int16_dtype_0 = const()[name = tensor<string, []>("op_32_shape_to_int16_dtype_0"), val = tensor<string, []>("int16")];
            tensor<uint16, []> gather_0_indices_0_to_uint16 = const()[name = tensor<string, []>("gather_0_indices_0_to_uint16"), val = tensor<uint16, []>(1)];
            tensor<int16, [2]> var_32_shape_to_int16 = cast(dtype = var_32_shape_to_int16_dtype_0, x = var_32_shape)[name = tensor<string, []>("cast_57")];
            tensor<int16, []> gather_0_cast_uint16 = gather(axis = gather_0_axis_0, batch_dims = gather_0_batch_dims_0, indices = gather_0_indices_0_to_uint16, validate_indices = gather_0_validate_indices_0, x = var_32_shape_to_int16)[name = tensor<string, []>("gather_0_cast_uint16")];
            tensor<string, []> gather_0_cast_uint16_to_int32_dtype_0 = const()[name = tensor<string, []>("gather_0_cast_uint16_to_int32_dtype_0"), val = tensor<string, []>("int32")];
            tensor<int32, []> concat_0_values0_0 = const()[name = tensor<string, []>("concat_0_values0_0"), val = tensor<int32, []>(1)];
            tensor<int32, []> concat_0_axis_0 = const()[name = tensor<string, []>("concat_0_axis_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> concat_0_interleave_0 = const()[name = tensor<string, []>("concat_0_interleave_0"), val = tensor<bool, []>(false)];
            tensor<int32, []> gather_0_cast_uint16_to_int32 = cast(dtype = gather_0_cast_uint16_to_int32_dtype_0, x = gather_0_cast_uint16)[name = tensor<string, []>("cast_56")];
            tensor<int32, [2]> concat_0 = concat(axis = concat_0_axis_0, interleave = concat_0_interleave_0, values = (concat_0_values0_0, gather_0_cast_uint16_to_int32))[name = tensor<string, []>("concat_0")];
            tensor<int32, [2]> input_3_begin_0 = const()[name = tensor<string, []>("input_3_begin_0"), val = tensor<int32, [2]>([0, 0])];
            tensor<bool, [2]> input_3_end_mask_0 = const()[name = tensor<string, []>("input_3_end_mask_0"), val = tensor<bool, [2]>([true, false])];
            tensor<int32, [1, ?]> input_3 = slice_by_index(begin = input_3_begin_0, end = concat_0, end_mask = input_3_end_mask_0, x = bert_embeddings_position_ids)[name = tensor<string, []>("input_3")];
            tensor<int32, []> inputs_embeds_axis_0 = const()[name = tensor<string, []>("inputs_embeds_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> inputs_embeds_batch_dims_0 = const()[name = tensor<string, []>("inputs_embeds_batch_dims_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> inputs_embeds_validate_indices_0 = const()[name = tensor<string, []>("inputs_embeds_validate_indices_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [21128, 768]> bert_embeddings_word_embeddings_weight_to_fp16 = const()[name = tensor<string, []>("bert_embeddings_word_embeddings_weight_to_fp16"), val = tensor<fp16, [21128, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<string, []> input_ids_to_uint16_dtype_0 = const()[name = tensor<string, []>("input_ids_to_uint16_dtype_0"), val = tensor<string, []>("uint16")];
            tensor<uint16, [1, ?]> input_ids_to_uint16 = cast(dtype = input_ids_to_uint16_dtype_0, x = input_ids)[name = tensor<string, []>("cast_55")];
            tensor<fp16, [1, ?, 768]> inputs_embeds_cast_fp16_cast_uint16 = gather(axis = inputs_embeds_axis_0, batch_dims = inputs_embeds_batch_dims_0, indices = input_ids_to_uint16, validate_indices = inputs_embeds_validate_indices_0, x = bert_embeddings_word_embeddings_weight_to_fp16)[name = tensor<string, []>("inputs_embeds_cast_fp16_cast_uint16")];
            tensor<int32, []> token_type_embeddings_1_axis_0 = const()[name = tensor<string, []>("token_type_embeddings_1_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> token_type_embeddings_1_batch_dims_0 = const()[name = tensor<string, []>("token_type_embeddings_1_batch_dims_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> token_type_embeddings_1_validate_indices_0 = const()[name = tensor<string, []>("token_type_embeddings_1_validate_indices_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [2, 768]> bert_embeddings_token_type_embeddings_weight_to_fp16 = const()[name = tensor<string, []>("bert_embeddings_token_type_embeddings_weight_to_fp16"), val = tensor<fp16, [2, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(32452736)))];
            tensor<string, []> input_1_to_uint16_dtype_0 = const()[name = tensor<string, []>("input_1_to_uint16_dtype_0"), val = tensor<string, []>("uint16")];
            tensor<uint16, [1, ?]> input_1_to_uint16 = cast(dtype = input_1_to_uint16_dtype_0, x = input_1)[name = tensor<string, []>("cast_54")];
            tensor<fp16, [1, ?, 768]> token_type_embeddings_1_cast_fp16_cast_uint16 = gather(axis = token_type_embeddings_1_axis_0, batch_dims = token_type_embeddings_1_batch_dims_0, indices = input_1_to_uint16, validate_indices = token_type_embeddings_1_validate_indices_0, x = bert_embeddings_token_type_embeddings_weight_to_fp16)[name = tensor<string, []>("token_type_embeddings_1_cast_fp16_cast_uint16")];
            tensor<fp16, [1, ?, 768]> embeddings_1_cast_fp16 = add(x = inputs_embeds_cast_fp16_cast_uint16, y = token_type_embeddings_1_cast_fp16_cast_uint16)[name = tensor<string, []>("embeddings_1_cast_fp16")];
            tensor<int32, []> position_embeddings_1_axis_0 = const()[name = tensor<string, []>("position_embeddings_1_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> position_embeddings_1_batch_dims_0 = const()[name = tensor<string, []>("position_embeddings_1_batch_dims_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> position_embeddings_1_validate_indices_0 = const()[name = tensor<string, []>("position_embeddings_1_validate_indices_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [512, 768]> bert_embeddings_position_embeddings_weight_to_fp16 = const()[name = tensor<string, []>("bert_embeddings_position_embeddings_weight_to_fp16"), val = tensor<fp16, [512, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(32455872)))];
            tensor<string, []> input_3_to_uint16_dtype_0 = const()[name = tensor<string, []>("input_3_to_uint16_dtype_0"), val = tensor<string, []>("uint16")];
            tensor<uint16, [1, ?]> input_3_to_uint16 = cast(dtype = input_3_to_uint16_dtype_0, x = input_3)[name = tensor<string, []>("cast_53")];
            tensor<fp16, [1, ?, 768]> position_embeddings_1_cast_fp16_cast_uint16 = gather(axis = position_embeddings_1_axis_0, batch_dims = position_embeddings_1_batch_dims_0, indices = input_3_to_uint16, validate_indices = position_embeddings_1_validate_indices_0, x = bert_embeddings_position_embeddings_weight_to_fp16)[name = tensor<string, []>("position_embeddings_1_cast_fp16_cast_uint16")];
            tensor<fp16, [1, ?, 768]> input_5_cast_fp16 = add(x = embeddings_1_cast_fp16, y = position_embeddings_1_cast_fp16_cast_uint16)[name = tensor<string, []>("input_5_cast_fp16")];
            tensor<int32, [1]> input_7_axes_0 = const()[name = tensor<string, []>("input_7_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [768]> bert_embeddings_LayerNorm_weight_to_fp16 = const()[name = tensor<string, []>("bert_embeddings_LayerNorm_weight_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(33242368)))];
            tensor<fp16, [768]> bert_embeddings_LayerNorm_bias_to_fp16 = const()[name = tensor<string, []>("bert_embeddings_LayerNorm_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(33243968)))];
            tensor<fp16, []> var_20_to_fp16 = const()[name = tensor<string, []>("op_20_to_fp16"), val = tensor<fp16, []>(0x1p-24)];
            tensor<fp16, [1, ?, 768]> input_7_cast_fp16 = layer_norm(axes = input_7_axes_0, beta = bert_embeddings_LayerNorm_bias_to_fp16, epsilon = var_20_to_fp16, gamma = bert_embeddings_LayerNorm_weight_to_fp16, x = input_5_cast_fp16)[name = tensor<string, []>("input_7_cast_fp16")];
            tensor<int32, [1]> var_53_axes_0 = const()[name = tensor<string, []>("op_53_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, [1, 1, ?]> var_53 = expand_dims(axes = var_53_axes_0, x = attention_mask)[name = tensor<string, []>("op_53")];
            tensor<int32, [1]> var_55_axes_0 = const()[name = tensor<string, []>("op_55_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<int32, [1, 1, 1, ?]> var_55 = expand_dims(axes = var_55_axes_0, x = var_53)[name = tensor<string, []>("op_55")];
            tensor<fp16, []> var_61_to_fp16 = const()[name = tensor<string, []>("op_61_to_fp16"), val = tensor<fp16, []>(0x1p+0)];
            tensor<string, []> var_60_to_fp16_dtype_0 = const()[name = tensor<string, []>("op_60_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [1, 1, 1, ?]> var_55_to_fp16 = cast(dtype = var_60_to_fp16_dtype_0, x = var_55)[name = tensor<string, []>("cast_52")];
            tensor<fp16, [1, 1, 1, ?]> var_63_cast_fp16 = sub(x = var_61_to_fp16, y = var_55_to_fp16)[name = tensor<string, []>("op_63_cast_fp16")];
            tensor<fp16, []> var_64_to_fp16 = const()[name = tensor<string, []>("op_64_to_fp16"), val = tensor<fp16, []>(-0x1.388p+13)];
            tensor<fp16, [1, 1, 1, ?]> attention_mask_cast_fp16 = mul(x = var_63_cast_fp16, y = var_64_to_fp16)[name = tensor<string, []>("attention_mask_cast_fp16")];
            tensor<fp16, [768, 768]> bert_encoder_layer_0_attention_self_query_weight_to_fp16 = const()[name = tensor<string, []>("bert_encoder_layer_0_attention_self_query_weight_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(33245568)))];
            tensor<fp16, [768]> bert_encoder_layer_0_attention_self_query_bias_to_fp16 = const()[name = tensor<string, []>("bert_encoder_layer_0_attention_self_query_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(34425280)))];
            tensor<fp16, [1, ?, 768]> linear_0_cast_fp16 = linear(bias = bert_encoder_layer_0_attention_self_query_bias_to_fp16, weight = bert_encoder_layer_0_attention_self_query_weight_to_fp16, x = input_7_cast_fp16)[name = tensor<string, []>("linear_0_cast_fp16")];
            tensor<int32, [4]> concat_1x = const()[name = tensor<string, []>("concat_1x"), val = tensor<int32, [4]>([1, -1, 12, 64])];
            tensor<fp16, [1, ?, 12, 64]> var_117_cast_fp16 = reshape(shape = concat_1x, x = linear_0_cast_fp16)[name = tensor<string, []>("op_117_cast_fp16")];
            tensor<fp16, [768, 768]> bert_encoder_layer_0_attention_self_key_weight_to_fp16 = const()[name = tensor<string, []>("bert_encoder_layer_0_attention_self_key_weight_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(34426880)))];
            tensor<fp16, [768]> bert_encoder_layer_0_attention_self_key_bias_to_fp16 = const()[name = tensor<string, []>("bert_encoder_layer_0_attention_self_key_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(35606592)))];
            tensor<fp16, [1, ?, 768]> linear_1_cast_fp16 = linear(bias = bert_encoder_layer_0_attention_self_key_bias_to_fp16, weight = bert_encoder_layer_0_attention_self_key_weight_to_fp16, x = input_7_cast_fp16)[name = tensor<string, []>("linear_1_cast_fp16")];
            tensor<int32, [4]> concat_2x = const()[name = tensor<string, []>("concat_2x"), val = tensor<int32, [4]>([1, -1, 12, 64])];
            tensor<fp16, [1, ?, 12, 64]> var_123_cast_fp16 = reshape(shape = concat_2x, x = linear_1_cast_fp16)[name = tensor<string, []>("op_123_cast_fp16")];
            tensor<fp16, [768, 768]> bert_encoder_layer_0_attention_self_value_weight_to_fp16 = const()[name = tensor<string, []>("bert_encoder_layer_0_attention_self_value_weight_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(35608192)))];
            tensor<fp16, [768]> bert_encoder_layer_0_attention_self_value_bias_to_fp16 = const()[name = tensor<string, []>("bert_encoder_layer_0_attention_self_value_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(36787904)))];
            tensor<fp16, [1, ?, 768]> linear_2_cast_fp16 = linear(bias = bert_encoder_layer_0_attention_self_value_bias_to_fp16, weight = bert_encoder_layer_0_attention_self_value_weight_to_fp16, x = input_7_cast_fp16)[name = tensor<string, []>("linear_2_cast_fp16")];
            tensor<int32, [4]> concat_3x = const()[name = tensor<string, []>("concat_3x"), val = tensor<int32, [4]>([1, -1, 12, 64])];
            tensor<fp16, [1, ?, 12, 64]> var_129_cast_fp16 = reshape(shape = concat_3x, x = linear_2_cast_fp16)[name = tensor<string, []>("op_129_cast_fp16")];
            tensor<int32, [4]> value_1_perm_0 = const()[name = tensor<string, []>("value_1_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, []> var_77_to_fp16 = const()[name = tensor<string, []>("op_77_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, ?, 12, 64]> mul_0_cast_fp16 = mul(x = var_117_cast_fp16, y = var_77_to_fp16)[name = tensor<string, []>("mul_0_cast_fp16")];
            tensor<bool, []> matmul_0_transpose_y_0 = const()[name = tensor<string, []>("matmul_0_transpose_y_0"), val = tensor<bool, []>(true)];
            tensor<bool, []> matmul_0_transpose_x_0 = const()[name = tensor<string, []>("matmul_0_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_48_perm_0 = const()[name = tensor<string, []>("transpose_48_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<int32, [4]> transpose_49_perm_0 = const()[name = tensor<string, []>("transpose_49_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<fp16, [1, 12, ?, 64]> transpose_49 = transpose(perm = transpose_49_perm_0, x = var_123_cast_fp16)[name = tensor<string, []>("transpose_117")];
            tensor<fp16, [1, 12, ?, 64]> transpose_48 = transpose(perm = transpose_48_perm_0, x = mul_0_cast_fp16)[name = tensor<string, []>("transpose_118")];
            tensor<fp16, [1, 12, ?, ?]> matmul_0_cast_fp16 = matmul(transpose_x = matmul_0_transpose_x_0, transpose_y = matmul_0_transpose_y_0, x = transpose_48, y = transpose_49)[name = tensor<string, []>("matmul_0_cast_fp16")];
            tensor<fp16, [1, 12, ?, ?]> add_0_cast_fp16 = add(x = matmul_0_cast_fp16, y = attention_mask_cast_fp16)[name = tensor<string, []>("add_0_cast_fp16")];
            tensor<int32, []> softmax_0_axis_0 = const()[name = tensor<string, []>("softmax_0_axis_0"), val = tensor<int32, []>(-1)];
            tensor<fp16, [1, 12, ?, ?]> softmax_0_cast_fp16 = softmax(axis = softmax_0_axis_0, x = add_0_cast_fp16)[name = tensor<string, []>("softmax_0_cast_fp16")];
            tensor<bool, []> attn_output_1_transpose_x_0 = const()[name = tensor<string, []>("attn_output_1_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_output_1_transpose_y_0 = const()[name = tensor<string, []>("attn_output_1_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 12, ?, 64]> value_1_cast_fp16 = transpose(perm = value_1_perm_0, x = var_129_cast_fp16)[name = tensor<string, []>("transpose_119")];
            tensor<fp16, [1, 12, ?, 64]> attn_output_1_cast_fp16 = matmul(transpose_x = attn_output_1_transpose_x_0, transpose_y = attn_output_1_transpose_y_0, x = softmax_0_cast_fp16, y = value_1_cast_fp16)[name = tensor<string, []>("attn_output_1_cast_fp16")];
            tensor<int32, [4]> var_132_perm_0 = const()[name = tensor<string, []>("op_132_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> concat_4x = const()[name = tensor<string, []>("concat_4x"), val = tensor<int32, [3]>([1, -1, 768])];
            tensor<fp16, [1, ?, 12, 64]> var_132_cast_fp16 = transpose(perm = var_132_perm_0, x = attn_output_1_cast_fp16)[name = tensor<string, []>("transpose_116")];
            tensor<fp16, [1, ?, 768]> var_135_cast_fp16 = reshape(shape = concat_4x, x = var_132_cast_fp16)[name = tensor<string, []>("op_135_cast_fp16")];
            tensor<fp16, [768, 768]> bert_encoder_layer_0_attention_output_dense_weight_to_fp16 = const()[name = tensor<string, []>("bert_encoder_layer_0_attention_output_dense_weight_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(36789504)))];
            tensor<fp16, [768]> bert_encoder_layer_0_attention_output_dense_bias_to_fp16 = const()[name = tensor<string, []>("bert_encoder_layer_0_attention_output_dense_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(37969216)))];
            tensor<fp16, [1, ?, 768]> linear_3_cast_fp16 = linear(bias = bert_encoder_layer_0_attention_output_dense_bias_to_fp16, weight = bert_encoder_layer_0_attention_output_dense_weight_to_fp16, x = var_135_cast_fp16)[name = tensor<string, []>("linear_3_cast_fp16")];
            tensor<fp16, [1, ?, 768]> input_13_cast_fp16 = add(x = linear_3_cast_fp16, y = input_7_cast_fp16)[name = tensor<string, []>("input_13_cast_fp16")];
            tensor<int32, [1]> input_15_axes_0 = const()[name = tensor<string, []>("input_15_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [768]> bert_encoder_layer_0_attention_output_LayerNorm_weight_to_fp16 = const()[name = tensor<string, []>("bert_encoder_layer_0_attention_output_LayerNorm_weight_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(37970816)))];
            tensor<fp16, [768]> bert_encoder_layer_0_attention_output_LayerNorm_bias_to_fp16 = const()[name = tensor<string, []>("bert_encoder_layer_0_attention_output_LayerNorm_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(37972416)))];
            tensor<fp16, []> var_68_to_fp16 = const()[name = tensor<string, []>("op_68_to_fp16"), val = tensor<fp16, []>(0x1p-24)];
            tensor<fp16, [1, ?, 768]> input_15_cast_fp16 = layer_norm(axes = input_15_axes_0, beta = bert_encoder_layer_0_attention_output_LayerNorm_bias_to_fp16, epsilon = var_68_to_fp16, gamma = bert_encoder_layer_0_attention_output_LayerNorm_weight_to_fp16, x = input_13_cast_fp16)[name = tensor<string, []>("input_15_cast_fp16")];
            tensor<fp16, [3072, 768]> bert_encoder_layer_0_intermediate_dense_weight_to_fp16 = const()[name = tensor<string, []>("bert_encoder_layer_0_intermediate_dense_weight_to_fp16"), val = tensor<fp16, [3072, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(37974016)))];
            tensor<fp16, [3072]> bert_encoder_layer_0_intermediate_dense_bias_to_fp16 = const()[name = tensor<string, []>("bert_encoder_layer_0_intermediate_dense_bias_to_fp16"), val = tensor<fp16, [3072]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(42692672)))];
            tensor<fp16, [1, ?, 3072]> linear_4_cast_fp16 = linear(bias = bert_encoder_layer_0_intermediate_dense_bias_to_fp16, weight = bert_encoder_layer_0_intermediate_dense_weight_to_fp16, x = input_15_cast_fp16)[name = tensor<string, []>("linear_4_cast_fp16")];
            tensor<string, []> input_19_mode_0 = const()[name = tensor<string, []>("input_19_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, ?, 3072]> input_19_cast_fp16 = gelu(mode = input_19_mode_0, x = linear_4_cast_fp16)[name = tensor<string, []>("input_19_cast_fp16")];
            tensor<fp16, [768, 3072]> bert_encoder_layer_0_output_dense_weight_to_fp16 = const()[name = tensor<string, []>("bert_encoder_layer_0_output_dense_weight_to_fp16"), val = tensor<fp16, [768, 3072]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(42698880)))];
            tensor<fp16, [768]> bert_encoder_layer_0_output_dense_bias_to_fp16 = const()[name = tensor<string, []>("bert_encoder_layer_0_output_dense_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(47417536)))];
            tensor<fp16, [1, ?, 768]> linear_5_cast_fp16 = linear(bias = bert_encoder_layer_0_output_dense_bias_to_fp16, weight = bert_encoder_layer_0_output_dense_weight_to_fp16, x = input_19_cast_fp16)[name = tensor<string, []>("linear_5_cast_fp16")];
            tensor<fp16, [1, ?, 768]> input_23_cast_fp16 = add(x = linear_5_cast_fp16, y = input_15_cast_fp16)[name = tensor<string, []>("input_23_cast_fp16")];
            tensor<int32, [1]> hidden_states_7_axes_0 = const()[name = tensor<string, []>("hidden_states_7_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [768]> bert_encoder_layer_0_output_LayerNorm_weight_to_fp16 = const()[name = tensor<string, []>("bert_encoder_layer_0_output_LayerNorm_weight_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(47419136)))];
            tensor<fp16, [768]> bert_encoder_layer_0_output_LayerNorm_bias_to_fp16 = const()[name = tensor<string, []>("bert_encoder_layer_0_output_LayerNorm_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(47420736)))];
            tensor<fp16, [1, ?, 768]> hidden_states_7_cast_fp16 = layer_norm(axes = hidden_states_7_axes_0, beta = bert_encoder_layer_0_output_LayerNorm_bias_to_fp16, epsilon = var_68_to_fp16, gamma = bert_encoder_layer_0_output_LayerNorm_weight_to_fp16, x = input_23_cast_fp16)[name = tensor<string, []>("hidden_states_7_cast_fp16")];
            tensor<fp16, [768, 768]> bert_encoder_layer_1_attention_self_query_weight_to_fp16 = const()[name = tensor<string, []>("bert_encoder_layer_1_attention_self_query_weight_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(47422336)))];
            tensor<fp16, [768]> bert_encoder_layer_1_attention_self_query_bias_to_fp16 = const()[name = tensor<string, []>("bert_encoder_layer_1_attention_self_query_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(48602048)))];
            tensor<fp16, [1, ?, 768]> linear_6_cast_fp16 = linear(bias = bert_encoder_layer_1_attention_self_query_bias_to_fp16, weight = bert_encoder_layer_1_attention_self_query_weight_to_fp16, x = hidden_states_7_cast_fp16)[name = tensor<string, []>("linear_6_cast_fp16")];
            tensor<int32, [4]> concat_5x = const()[name = tensor<string, []>("concat_5x"), val = tensor<int32, [4]>([1, -1, 12, 64])];
            tensor<fp16, [1, ?, 12, 64]> var_178_cast_fp16 = reshape(shape = concat_5x, x = linear_6_cast_fp16)[name = tensor<string, []>("op_178_cast_fp16")];
            tensor<fp16, [768, 768]> bert_encoder_layer_1_attention_self_key_weight_to_fp16 = const()[name = tensor<string, []>("bert_encoder_layer_1_attention_self_key_weight_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(48603648)))];
            tensor<fp16, [768]> bert_encoder_layer_1_attention_self_key_bias_to_fp16 = const()[name = tensor<string, []>("bert_encoder_layer_1_attention_self_key_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(49783360)))];
            tensor<fp16, [1, ?, 768]> linear_7_cast_fp16 = linear(bias = bert_encoder_layer_1_attention_self_key_bias_to_fp16, weight = bert_encoder_layer_1_attention_self_key_weight_to_fp16, x = hidden_states_7_cast_fp16)[name = tensor<string, []>("linear_7_cast_fp16")];
            tensor<int32, [4]> concat_6x = const()[name = tensor<string, []>("concat_6x"), val = tensor<int32, [4]>([1, -1, 12, 64])];
            tensor<fp16, [1, ?, 12, 64]> var_184_cast_fp16 = reshape(shape = concat_6x, x = linear_7_cast_fp16)[name = tensor<string, []>("op_184_cast_fp16")];
            tensor<fp16, [768, 768]> bert_encoder_layer_1_attention_self_value_weight_to_fp16 = const()[name = tensor<string, []>("bert_encoder_layer_1_attention_self_value_weight_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(49784960)))];
            tensor<fp16, [768]> bert_encoder_layer_1_attention_self_value_bias_to_fp16 = const()[name = tensor<string, []>("bert_encoder_layer_1_attention_self_value_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(50964672)))];
            tensor<fp16, [1, ?, 768]> linear_8_cast_fp16 = linear(bias = bert_encoder_layer_1_attention_self_value_bias_to_fp16, weight = bert_encoder_layer_1_attention_self_value_weight_to_fp16, x = hidden_states_7_cast_fp16)[name = tensor<string, []>("linear_8_cast_fp16")];
            tensor<int32, [4]> concat_7x = const()[name = tensor<string, []>("concat_7x"), val = tensor<int32, [4]>([1, -1, 12, 64])];
            tensor<fp16, [1, ?, 12, 64]> var_190_cast_fp16 = reshape(shape = concat_7x, x = linear_8_cast_fp16)[name = tensor<string, []>("op_190_cast_fp16")];
            tensor<int32, [4]> value_3_perm_0 = const()[name = tensor<string, []>("value_3_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, [1, ?, 12, 64]> mul_1_cast_fp16 = mul(x = var_178_cast_fp16, y = var_77_to_fp16)[name = tensor<string, []>("mul_1_cast_fp16")];
            tensor<bool, []> matmul_1_transpose_y_0 = const()[name = tensor<string, []>("matmul_1_transpose_y_0"), val = tensor<bool, []>(true)];
            tensor<bool, []> matmul_1_transpose_x_0 = const()[name = tensor<string, []>("matmul_1_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_50_perm_0 = const()[name = tensor<string, []>("transpose_50_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<int32, [4]> transpose_51_perm_0 = const()[name = tensor<string, []>("transpose_51_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<fp16, [1, 12, ?, 64]> transpose_51 = transpose(perm = transpose_51_perm_0, x = var_184_cast_fp16)[name = tensor<string, []>("transpose_113")];
            tensor<fp16, [1, 12, ?, 64]> transpose_50 = transpose(perm = transpose_50_perm_0, x = mul_1_cast_fp16)[name = tensor<string, []>("transpose_114")];
            tensor<fp16, [1, 12, ?, ?]> matmul_1_cast_fp16 = matmul(transpose_x = matmul_1_transpose_x_0, transpose_y = matmul_1_transpose_y_0, x = transpose_50, y = transpose_51)[name = tensor<string, []>("matmul_1_cast_fp16")];
            tensor<fp16, [1, 12, ?, ?]> add_1_cast_fp16 = add(x = matmul_1_cast_fp16, y = attention_mask_cast_fp16)[name = tensor<string, []>("add_1_cast_fp16")];
            tensor<int32, []> softmax_1_axis_0 = const()[name = tensor<string, []>("softmax_1_axis_0"), val = tensor<int32, []>(-1)];
            tensor<fp16, [1, 12, ?, ?]> softmax_1_cast_fp16 = softmax(axis = softmax_1_axis_0, x = add_1_cast_fp16)[name = tensor<string, []>("softmax_1_cast_fp16")];
            tensor<bool, []> attn_output_5_transpose_x_0 = const()[name = tensor<string, []>("attn_output_5_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_output_5_transpose_y_0 = const()[name = tensor<string, []>("attn_output_5_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 12, ?, 64]> value_3_cast_fp16 = transpose(perm = value_3_perm_0, x = var_190_cast_fp16)[name = tensor<string, []>("transpose_115")];
            tensor<fp16, [1, 12, ?, 64]> attn_output_5_cast_fp16 = matmul(transpose_x = attn_output_5_transpose_x_0, transpose_y = attn_output_5_transpose_y_0, x = softmax_1_cast_fp16, y = value_3_cast_fp16)[name = tensor<string, []>("attn_output_5_cast_fp16")];
            tensor<int32, [4]> var_193_perm_0 = const()[name = tensor<string, []>("op_193_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> concat_8x = const()[name = tensor<string, []>("concat_8x"), val = tensor<int32, [3]>([1, -1, 768])];
            tensor<fp16, [1, ?, 12, 64]> var_193_cast_fp16 = transpose(perm = var_193_perm_0, x = attn_output_5_cast_fp16)[name = tensor<string, []>("transpose_112")];
            tensor<fp16, [1, ?, 768]> var_196_cast_fp16 = reshape(shape = concat_8x, x = var_193_cast_fp16)[name = tensor<string, []>("op_196_cast_fp16")];
            tensor<fp16, [768, 768]> bert_encoder_layer_1_attention_output_dense_weight_to_fp16 = const()[name = tensor<string, []>("bert_encoder_layer_1_attention_output_dense_weight_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(50966272)))];
            tensor<fp16, [768]> bert_encoder_layer_1_attention_output_dense_bias_to_fp16 = const()[name = tensor<string, []>("bert_encoder_layer_1_attention_output_dense_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(52145984)))];
            tensor<fp16, [1, ?, 768]> linear_9_cast_fp16 = linear(bias = bert_encoder_layer_1_attention_output_dense_bias_to_fp16, weight = bert_encoder_layer_1_attention_output_dense_weight_to_fp16, x = var_196_cast_fp16)[name = tensor<string, []>("linear_9_cast_fp16")];
            tensor<fp16, [1, ?, 768]> input_29_cast_fp16 = add(x = linear_9_cast_fp16, y = hidden_states_7_cast_fp16)[name = tensor<string, []>("input_29_cast_fp16")];
            tensor<int32, [1]> input_31_axes_0 = const()[name = tensor<string, []>("input_31_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [768]> bert_encoder_layer_1_attention_output_LayerNorm_weight_to_fp16 = const()[name = tensor<string, []>("bert_encoder_layer_1_attention_output_LayerNorm_weight_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(52147584)))];
            tensor<fp16, [768]> bert_encoder_layer_1_attention_output_LayerNorm_bias_to_fp16 = const()[name = tensor<string, []>("bert_encoder_layer_1_attention_output_LayerNorm_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(52149184)))];
            tensor<fp16, [1, ?, 768]> input_31_cast_fp16 = layer_norm(axes = input_31_axes_0, beta = bert_encoder_layer_1_attention_output_LayerNorm_bias_to_fp16, epsilon = var_68_to_fp16, gamma = bert_encoder_layer_1_attention_output_LayerNorm_weight_to_fp16, x = input_29_cast_fp16)[name = tensor<string, []>("input_31_cast_fp16")];
            tensor<fp16, [3072, 768]> bert_encoder_layer_1_intermediate_dense_weight_to_fp16 = const()[name = tensor<string, []>("bert_encoder_layer_1_intermediate_dense_weight_to_fp16"), val = tensor<fp16, [3072, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(52150784)))];
            tensor<fp16, [3072]> bert_encoder_layer_1_intermediate_dense_bias_to_fp16 = const()[name = tensor<string, []>("bert_encoder_layer_1_intermediate_dense_bias_to_fp16"), val = tensor<fp16, [3072]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(56869440)))];
            tensor<fp16, [1, ?, 3072]> linear_10_cast_fp16 = linear(bias = bert_encoder_layer_1_intermediate_dense_bias_to_fp16, weight = bert_encoder_layer_1_intermediate_dense_weight_to_fp16, x = input_31_cast_fp16)[name = tensor<string, []>("linear_10_cast_fp16")];
            tensor<string, []> input_35_mode_0 = const()[name = tensor<string, []>("input_35_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, ?, 3072]> input_35_cast_fp16 = gelu(mode = input_35_mode_0, x = linear_10_cast_fp16)[name = tensor<string, []>("input_35_cast_fp16")];
            tensor<fp16, [768, 3072]> bert_encoder_layer_1_output_dense_weight_to_fp16 = const()[name = tensor<string, []>("bert_encoder_layer_1_output_dense_weight_to_fp16"), val = tensor<fp16, [768, 3072]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(56875648)))];
            tensor<fp16, [768]> bert_encoder_layer_1_output_dense_bias_to_fp16 = const()[name = tensor<string, []>("bert_encoder_layer_1_output_dense_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(61594304)))];
            tensor<fp16, [1, ?, 768]> linear_11_cast_fp16 = linear(bias = bert_encoder_layer_1_output_dense_bias_to_fp16, weight = bert_encoder_layer_1_output_dense_weight_to_fp16, x = input_35_cast_fp16)[name = tensor<string, []>("linear_11_cast_fp16")];
            tensor<fp16, [1, ?, 768]> input_39_cast_fp16 = add(x = linear_11_cast_fp16, y = input_31_cast_fp16)[name = tensor<string, []>("input_39_cast_fp16")];
            tensor<int32, [1]> hidden_states_13_axes_0 = const()[name = tensor<string, []>("hidden_states_13_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [768]> bert_encoder_layer_1_output_LayerNorm_weight_to_fp16 = const()[name = tensor<string, []>("bert_encoder_layer_1_output_LayerNorm_weight_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(61595904)))];
            tensor<fp16, [768]> bert_encoder_layer_1_output_LayerNorm_bias_to_fp16 = const()[name = tensor<string, []>("bert_encoder_layer_1_output_LayerNorm_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(61597504)))];
            tensor<fp16, [1, ?, 768]> hidden_states_13_cast_fp16 = layer_norm(axes = hidden_states_13_axes_0, beta = bert_encoder_layer_1_output_LayerNorm_bias_to_fp16, epsilon = var_68_to_fp16, gamma = bert_encoder_layer_1_output_LayerNorm_weight_to_fp16, x = input_39_cast_fp16)[name = tensor<string, []>("hidden_states_13_cast_fp16")];
            tensor<fp16, [768, 768]> bert_encoder_layer_2_attention_self_query_weight_to_fp16 = const()[name = tensor<string, []>("bert_encoder_layer_2_attention_self_query_weight_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(61599104)))];
            tensor<fp16, [768]> bert_encoder_layer_2_attention_self_query_bias_to_fp16 = const()[name = tensor<string, []>("bert_encoder_layer_2_attention_self_query_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(62778816)))];
            tensor<fp16, [1, ?, 768]> linear_12_cast_fp16 = linear(bias = bert_encoder_layer_2_attention_self_query_bias_to_fp16, weight = bert_encoder_layer_2_attention_self_query_weight_to_fp16, x = hidden_states_13_cast_fp16)[name = tensor<string, []>("linear_12_cast_fp16")];
            tensor<int32, [4]> concat_9x = const()[name = tensor<string, []>("concat_9x"), val = tensor<int32, [4]>([1, -1, 12, 64])];
            tensor<fp16, [1, ?, 12, 64]> var_239_cast_fp16 = reshape(shape = concat_9x, x = linear_12_cast_fp16)[name = tensor<string, []>("op_239_cast_fp16")];
            tensor<fp16, [768, 768]> bert_encoder_layer_2_attention_self_key_weight_to_fp16 = const()[name = tensor<string, []>("bert_encoder_layer_2_attention_self_key_weight_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(62780416)))];
            tensor<fp16, [768]> bert_encoder_layer_2_attention_self_key_bias_to_fp16 = const()[name = tensor<string, []>("bert_encoder_layer_2_attention_self_key_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(63960128)))];
            tensor<fp16, [1, ?, 768]> linear_13_cast_fp16 = linear(bias = bert_encoder_layer_2_attention_self_key_bias_to_fp16, weight = bert_encoder_layer_2_attention_self_key_weight_to_fp16, x = hidden_states_13_cast_fp16)[name = tensor<string, []>("linear_13_cast_fp16")];
            tensor<int32, [4]> concat_10x = const()[name = tensor<string, []>("concat_10x"), val = tensor<int32, [4]>([1, -1, 12, 64])];
            tensor<fp16, [1, ?, 12, 64]> var_245_cast_fp16 = reshape(shape = concat_10x, x = linear_13_cast_fp16)[name = tensor<string, []>("op_245_cast_fp16")];
            tensor<fp16, [768, 768]> bert_encoder_layer_2_attention_self_value_weight_to_fp16 = const()[name = tensor<string, []>("bert_encoder_layer_2_attention_self_value_weight_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(63961728)))];
            tensor<fp16, [768]> bert_encoder_layer_2_attention_self_value_bias_to_fp16 = const()[name = tensor<string, []>("bert_encoder_layer_2_attention_self_value_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(65141440)))];
            tensor<fp16, [1, ?, 768]> linear_14_cast_fp16 = linear(bias = bert_encoder_layer_2_attention_self_value_bias_to_fp16, weight = bert_encoder_layer_2_attention_self_value_weight_to_fp16, x = hidden_states_13_cast_fp16)[name = tensor<string, []>("linear_14_cast_fp16")];
            tensor<int32, [4]> concat_11x = const()[name = tensor<string, []>("concat_11x"), val = tensor<int32, [4]>([1, -1, 12, 64])];
            tensor<fp16, [1, ?, 12, 64]> var_251_cast_fp16 = reshape(shape = concat_11x, x = linear_14_cast_fp16)[name = tensor<string, []>("op_251_cast_fp16")];
            tensor<int32, [4]> value_5_perm_0 = const()[name = tensor<string, []>("value_5_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, [1, ?, 12, 64]> mul_2_cast_fp16 = mul(x = var_239_cast_fp16, y = var_77_to_fp16)[name = tensor<string, []>("mul_2_cast_fp16")];
            tensor<bool, []> matmul_2_transpose_y_0 = const()[name = tensor<string, []>("matmul_2_transpose_y_0"), val = tensor<bool, []>(true)];
            tensor<bool, []> matmul_2_transpose_x_0 = const()[name = tensor<string, []>("matmul_2_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_52_perm_0 = const()[name = tensor<string, []>("transpose_52_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<int32, [4]> transpose_53_perm_0 = const()[name = tensor<string, []>("transpose_53_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<fp16, [1, 12, ?, 64]> transpose_53 = transpose(perm = transpose_53_perm_0, x = var_245_cast_fp16)[name = tensor<string, []>("transpose_109")];
            tensor<fp16, [1, 12, ?, 64]> transpose_52 = transpose(perm = transpose_52_perm_0, x = mul_2_cast_fp16)[name = tensor<string, []>("transpose_110")];
            tensor<fp16, [1, 12, ?, ?]> matmul_2_cast_fp16 = matmul(transpose_x = matmul_2_transpose_x_0, transpose_y = matmul_2_transpose_y_0, x = transpose_52, y = transpose_53)[name = tensor<string, []>("matmul_2_cast_fp16")];
            tensor<fp16, [1, 12, ?, ?]> add_2_cast_fp16 = add(x = matmul_2_cast_fp16, y = attention_mask_cast_fp16)[name = tensor<string, []>("add_2_cast_fp16")];
            tensor<int32, []> softmax_2_axis_0 = const()[name = tensor<string, []>("softmax_2_axis_0"), val = tensor<int32, []>(-1)];
            tensor<fp16, [1, 12, ?, ?]> softmax_2_cast_fp16 = softmax(axis = softmax_2_axis_0, x = add_2_cast_fp16)[name = tensor<string, []>("softmax_2_cast_fp16")];
            tensor<bool, []> attn_output_9_transpose_x_0 = const()[name = tensor<string, []>("attn_output_9_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_output_9_transpose_y_0 = const()[name = tensor<string, []>("attn_output_9_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 12, ?, 64]> value_5_cast_fp16 = transpose(perm = value_5_perm_0, x = var_251_cast_fp16)[name = tensor<string, []>("transpose_111")];
            tensor<fp16, [1, 12, ?, 64]> attn_output_9_cast_fp16 = matmul(transpose_x = attn_output_9_transpose_x_0, transpose_y = attn_output_9_transpose_y_0, x = softmax_2_cast_fp16, y = value_5_cast_fp16)[name = tensor<string, []>("attn_output_9_cast_fp16")];
            tensor<int32, [4]> var_254_perm_0 = const()[name = tensor<string, []>("op_254_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> concat_12x = const()[name = tensor<string, []>("concat_12x"), val = tensor<int32, [3]>([1, -1, 768])];
            tensor<fp16, [1, ?, 12, 64]> var_254_cast_fp16 = transpose(perm = var_254_perm_0, x = attn_output_9_cast_fp16)[name = tensor<string, []>("transpose_108")];
            tensor<fp16, [1, ?, 768]> var_257_cast_fp16 = reshape(shape = concat_12x, x = var_254_cast_fp16)[name = tensor<string, []>("op_257_cast_fp16")];
            tensor<fp16, [768, 768]> bert_encoder_layer_2_attention_output_dense_weight_to_fp16 = const()[name = tensor<string, []>("bert_encoder_layer_2_attention_output_dense_weight_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(65143040)))];
            tensor<fp16, [768]> bert_encoder_layer_2_attention_output_dense_bias_to_fp16 = const()[name = tensor<string, []>("bert_encoder_layer_2_attention_output_dense_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(66322752)))];
            tensor<fp16, [1, ?, 768]> linear_15_cast_fp16 = linear(bias = bert_encoder_layer_2_attention_output_dense_bias_to_fp16, weight = bert_encoder_layer_2_attention_output_dense_weight_to_fp16, x = var_257_cast_fp16)[name = tensor<string, []>("linear_15_cast_fp16")];
            tensor<fp16, [1, ?, 768]> input_45_cast_fp16 = add(x = linear_15_cast_fp16, y = hidden_states_13_cast_fp16)[name = tensor<string, []>("input_45_cast_fp16")];
            tensor<int32, [1]> input_47_axes_0 = const()[name = tensor<string, []>("input_47_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [768]> bert_encoder_layer_2_attention_output_LayerNorm_weight_to_fp16 = const()[name = tensor<string, []>("bert_encoder_layer_2_attention_output_LayerNorm_weight_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(66324352)))];
            tensor<fp16, [768]> bert_encoder_layer_2_attention_output_LayerNorm_bias_to_fp16 = const()[name = tensor<string, []>("bert_encoder_layer_2_attention_output_LayerNorm_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(66325952)))];
            tensor<fp16, [1, ?, 768]> input_47_cast_fp16 = layer_norm(axes = input_47_axes_0, beta = bert_encoder_layer_2_attention_output_LayerNorm_bias_to_fp16, epsilon = var_68_to_fp16, gamma = bert_encoder_layer_2_attention_output_LayerNorm_weight_to_fp16, x = input_45_cast_fp16)[name = tensor<string, []>("input_47_cast_fp16")];
            tensor<fp16, [3072, 768]> bert_encoder_layer_2_intermediate_dense_weight_to_fp16 = const()[name = tensor<string, []>("bert_encoder_layer_2_intermediate_dense_weight_to_fp16"), val = tensor<fp16, [3072, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(66327552)))];
            tensor<fp16, [3072]> bert_encoder_layer_2_intermediate_dense_bias_to_fp16 = const()[name = tensor<string, []>("bert_encoder_layer_2_intermediate_dense_bias_to_fp16"), val = tensor<fp16, [3072]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(71046208)))];
            tensor<fp16, [1, ?, 3072]> linear_16_cast_fp16 = linear(bias = bert_encoder_layer_2_intermediate_dense_bias_to_fp16, weight = bert_encoder_layer_2_intermediate_dense_weight_to_fp16, x = input_47_cast_fp16)[name = tensor<string, []>("linear_16_cast_fp16")];
            tensor<string, []> input_51_mode_0 = const()[name = tensor<string, []>("input_51_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, ?, 3072]> input_51_cast_fp16 = gelu(mode = input_51_mode_0, x = linear_16_cast_fp16)[name = tensor<string, []>("input_51_cast_fp16")];
            tensor<fp16, [768, 3072]> bert_encoder_layer_2_output_dense_weight_to_fp16 = const()[name = tensor<string, []>("bert_encoder_layer_2_output_dense_weight_to_fp16"), val = tensor<fp16, [768, 3072]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(71052416)))];
